cask_args appdir: "/Applications"

# Repositories
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"
tap "qmk/qmk"

# Packages
brew "ast-grep"
brew "autossh"
brew "btop"
brew "deno"
brew "fd"
brew "fish"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gpg"
brew "hashicorp/tap/terraform"
brew "imagemagick"
brew "lazygit"
brew "llvm"
brew "luarocks"
brew "mas" # Mac App Store
brew "neovim"
brew "nmap"
brew "poppler"
brew "postgresql@13"
brew "pnpm"
brew "qmk/qmk/qmk"
brew "ripgrep"
brew "sevenzip"
brew "stow"
brew "tree"
brew "wget"
brew "yarn"
brew "yazi"
brew "yq"
brew "zoxide"

# Applications
cask "1password"
cask "arc"
cask "claude"
cask "cursor"
cask "datagrip"
cask "discord"
cask "docker"
cask "dropbox"
cask "elgato-control-center"
cask "figma"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "keycastr"
cask "kitty"
cask "logi-options+"
cask "loom"
cask "lm-studio"
cask "microsoft-teams"
cask "miro"
cask "nordlayer"
cask "notion"
cask "postman"
cask "postman-agent"
cask "raycast"
cask "repo-prompt"
cask "slack"
cask "spotify"
cask "ticktick"
cask "tradingview"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "windsurf"
cask "zed"
cask "zed@preview"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
