cask_args appdir: "/Applications"

# Repositories
tap "charmbracelet/tap"
tap "entireio/tap"
tap "hashicorp/tap"
tap "qmk/qmk"

# Tools
brew "agent-browser"
brew "ast-grep"
brew "autossh"
brew "awscli"
brew "bat"
brew "btop"
brew "charmbracelet/tap/crush"
brew "fd"
brew "fish"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gpg"
brew "go"
brew "gomplate"
brew "hashicorp/tap/terraform"
brew "helix"
brew "imagemagick"
brew "lazygit"
brew "llvm"
brew "luarocks"
brew "mas" # Mac App Store
brew "nmap"
brew "anomalyco/tap/opencode"
brew "pi-coding-agent"
brew "poppler"
brew "postgresql@18"
brew "pulumi"
brew "qmk/qmk/qmk"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "skills"
brew "stow"
brew "television"
brew "tree"
brew "tree-sitter-cli"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"

# Package Managers
brew "bob"       # Neovim
brew "rustup"    # Rust
brew "uv"        # Python
brew "deno"      # Node
brew "pnpm"      # Node
brew "yarn"      # Node

# Language Servers
brew "basedpyright"                  # Python
brew "gopls"                         # Go
brew "lua-language-server"           # Lua
brew "sql-language-server"           # SQL
brew "tailwindcss-language-server"   # Tailwind CSS
brew "vscode-langservers-extracted"  # HTML, CSS, JSON
brew "vtsls"                         # TypeScript/JavaScript (VSCode port)
brew "yaml-language-server"          # YAML
brew "taplo"                         # TOML

# Formatters
brew "biome"
brew "prettier"
brew "stylua"

# Applications
cask "1password"
cask "antigravity"
cask "arc"
cask "brainfm"
cask "claude"
cask "cursor"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "entire"
cask "figma"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "homerow"
cask "kitty"
cask "kaleidoscope"
cask "logi-options+"
cask "loom"
cask "microsoft-teams"
cask "miro"
cask "nordlayer"
cask "notion"
cask "ollama-app"
cask "postman"
cask "postman-agent"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "spotify"
cask "superwhisper"
cask "ticktick"
cask "tradingview"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "yaak"
cask "zed"
cask "zed@preview"
cask "zoom"

# Fonts
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
